{"url": "https://pubmed.ncbi.nlm.nih.gov/40790623/", "title": "The composition, functionality, and application of special oilseed proteins: A review.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-10-01T00:00:00+00:00", "quality_score": 0.7335, "relevance": 0.3096, "tags": ["plant", "quality"], "text": "The composition, functionality, and application of special oilseed proteins: A review. The composition, functionality, and application of special oilseed proteins: A review. Special oilseeds are those with lower yields than bulk ones, richer in oil nutrients, and mainly used for producing nutritious and functional edible oils. Special oilseed proteins are extracted from these special oilseeds and feature high digestibility and an acceptable flavor. They are expected to complement the deficiencies of bulk proteins and expand the plant protein resource pool. Consequently, this paper reviews the enrichment, composition, functional properties, and application status of several common special oilseed proteins (sunflower seed protein, flaxseed protein, sesame seed protein, hemp seed protein, walnut protein, and perilla seed protein). The aim is to understand the development status of special oilseed proteins comprehensively, explore effective strategies to break through their application bottlenecks, and thus expand the possibilities of their applications. At present, special oilseed proteins possess excellent nutritional and functional properties and have broad application prospects. Nevertheless, the enrichment techniques for special oilseed proteins in food processing are restricted compared to the comprehensive application systems of bulk oilseed proteins. The relatively high proportion of non-protein components in the raw materials hampers their extraction, leading to a low extraction rate. Additionally, common issues among plant proteins, such as low solubility and incomplete amino acid composition, also limit their applications. Integrating new and traditional extraction methods, formulating multiple protein combinations, and modifying functional properties will contribute to the further application of special oilseed proteins."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40818676/", "title": "Characterization of whey proteins and their derived peptides in Binglangjiang versus Dehong buffalo milk.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-14T00:00:00+00:00", "quality_score": 0.5895, "relevance": 0.3513, "tags": ["whey"], "text": "Characterization of whey proteins and their derived peptides in Binglangjiang versus Dehong buffalo milk. Characterization of whey proteins and their derived peptides in Binglangjiang versus Dehong buffalo milk. As unique genetic resources, the differential characteristics of whey proteins and their derived peptides between Binglangjiang and Dehong buffaloes remain unclear. This study employed an integrated proteomics and peptidomics approach to elucidate the similarities and differences in whey proteins and their derived peptides between the 2 buffalo species. Proteomic analysis identified 405 proteins in total, 15 unique proteins and 390 common proteins (6 showed significant expression differences), indicating high similarity in whey protein composition between the 2 species. A total of 75 peptides were identified from whey proteins of both buffalo species following simulated gastrointestinal digestion, with the Î²-lactoglobulin-derived peptide TPEVDDEALEK being the most abundant. Twelve of these peptides possess potential immunomodulatory, anti-inflammatory, and antimicrobial activities in silico prediction. Furthermore, both whey proteins and their derived peptides could promote the proliferation of RAW264.7 cells and inhibit nitric oxide (NO) secretion in LPS-stimulated RAW264.7 cells, especially Binglangjiang buffalo. These 2 buffalo species demonstrated similarities in whey protein composition, derived peptides, and their activities. These findings provided important insights for understanding the nutritional value and functional properties of buffalo whey proteins."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40812474/", "title": "Protein or indispensable amino acids supplementation after deficiency partially restored growth and did not induce higher adiposity in growing rats.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-12T00:00:00+00:00", "quality_score": 0.5856, "relevance": 0.3538, "tags": [], "text": "Protein or indispensable amino acids supplementation after deficiency partially restored growth and did not induce higher adiposity in growing rats. Protein or indispensable amino acids supplementation after deficiency partially restored growth and did not induce higher adiposity in growing rats. Inadequate protein intake in early life is associated with both growth retardation and a higher risk of metabolic syndrome in later life. This study aimed to evaluate the effects on energy metabolism of protein or indispensable amino acids (IAA) (lysine, threonine, and methionine) supplementation following a deficiency in growing rats. Sixty Wistar Han male rats were fed a control (20% protein by energy content), protein deficient (P5,5% protein by energy content), or lysine, threonine or methionine deficient diet (L25,T25,M25, 25% of the IAA requirement) for 3 weeks and thereafter were supplemented for 3 weeks with the deficient IAA or protein to reach 100% of the IAA (T100,L100,M100) or protein requirement (P20). Body weight (BW) and relative food intake (rFI) were measured daily. Body composition, naso-anal length (NAL), energy expenditure, and plasma FGF-21 were measured at the end of the deficiency and supplementation phases. Data were analyzed using one way or Mixed-model ANOVA and Bonferonni tests for multiple comparisons. All the deficient diets induced growth retardation (lower BW, lean body mass (LBM) and NAL) with threonine deficiency having the most severe effect (60% lower BW of Ctr, p<0,001). Supplementation induced a resumption of growth, but BW and LBM remained lower (15 to 35% for BW and 69 to 84% for LBM of Ctr, p<0,001 Despite increased rFI, no excess adiposity was observed post-supplementation in P20 and T100 groups, likely due to increased energy expenditure (p<0.001). In L100 and M100 groups, rFI increased (by 35% and 30%, respectively, p<0.001) without a corresponding rise in energy expenditure. FGF-21 was inversely associated with the protein and IAA status during both deficiency and supplementation (p<0,001). These findings highlight the distinct roles of individual IAAs in growth and metabolic recovery and suggest that targeted AAI supplementation may improve nutritional interventions."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40808373/", "title": "Increasing dietary soybean-derived trypsin inhibitor protein compromises nursery pig performance, nitrogen digestibility and retention.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-12T00:00:00+00:00", "quality_score": 0.5814, "relevance": 0.3452, "tags": ["quality"], "text": "Increasing dietary soybean-derived trypsin inhibitor protein compromises nursery pig performance, nitrogen digestibility and retention. Increasing dietary soybean-derived trypsin inhibitor protein compromises nursery pig performance, nitrogen digestibility and retention. Trypsin inhibitor proteins, intrinsic to soybeans and soy products, have been found to impair amino acid bioavailability, thereby attenuating pig growth performance. The objective of this experiment was to examine the effect of varying dietary trypsin inhibitor units (TIU) on the performance, nitrogen digestibility and retention in nursery pigs. Sixty barrows (5.6 Â± 0.65 kg body weight [BW]), weaned at 19-21 d of age, were randomly allocated across six dietary treatments (n=10/treatment). Diets balanced for metabolizable energy (ME), crude protein, neutral detergent fiber (NDF), and standardized ileal digestible (SID) lysine were fed in two phases over the 42-d study, lasting 14 and 28 d, respectively. Dietary treatments were formulated on a soybean TIU protein (TIU/mg) basis, using soybean meal, raw whole soybeans, soybean oil, and soyhulls to target 0.5, 1, 2, 3, 4, and 6 TIU/mg in complete feed for both dietary phases. For phase 1 and 2 diets, analyzed TIU/mg were 0.22/0.54, 0.47/0.61, 1.71/1.98, 2.88/3.44, 3.79/4.01, and 6.15/5.42, respectively, averaging 0.38, 0.54, 1.85, 3.16, 3.9, and 5.79 TIU/mg across both phases. Pigs were individually housed with ad libitum access to water and feed. Pig BW and feed disappearance were measured at the start and end of each phase to calculate pig performance parameters. On d 17, a subgroup of 48 pigs (n=8/treatment) were moved to metabolism crates for total fecal and urine collection to analyze nitrogen digestibility and retention. Data were analyzed using pig as the experimental unit to assess the effect of analyzed TIU levels, including linear and quadratic contrasts on all parameters. No quadratic responses were reported overall (P > 0.05). At the end of the experiment, pig BW decreased from 25.3 to 15.5 kg as the diet increased from 0.38 to 5.79 TIU/mg (linear, P < 0.0001). Moreover, as TIU increased, overall average daily gain, average daily feed intake, and feed efficiency were attenuated, resulting in reductions by 49, 32, and 26%, respectively (linear, P < 0.01). During phase 2, at the highest levels of dietary TIU/mg, nitrogen digestibility (%) was reduced by 5.3% (linear, P = 0.001), and nitrogen retention (% of intake) decreased by 15.3% (linear, P < 0.0001). In conclusion, there was a constant reduction in growth performance, feed efficiency, and nitrogen retention as soybean TIU increased in the diet of nursery pigs."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40812478/", "title": "True ileal amino acid digestibility of human foods classified according to food type as determined in the growing pig.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-12T00:00:00+00:00", "quality_score": 0.5783, "relevance": 0.3391, "tags": ["quality"], "text": "True ileal amino acid digestibility of human foods classified according to food type as determined in the growing pig. True ileal amino acid digestibility of human foods classified according to food type as determined in the growing pig. An FAO Expert Consultation recommended the use of digestible indispensable amino acid score (DIAAS) to evaluate protein quality of foods for humans. Calculation of DIAAS requires true ileal digestibility (TID) of amino acid (AA) values but currently insufficient data are available. To generate in pigs TID of AA for a wide range of foods commonly consumed by humans and determine the range of differences in TID of AA among food types. A standardised protocol was followed to determine TID of AA in 97 foods across 3 laboratories. Female pigs (25-100 kg during study, n>6) received foods for 7 days following a Youden Square design with ileal digesta collected via T-cannula on days 6-7. Endogenous AA losses were determined by feeding a protein-free diet. Foods, diets and digesta were analysed for nitrogen, AA, reactive lysine, titanium and dry matter. Foods were categorized into food types with the degree of variation within each food type evaluated using descriptive statistics. The TID (mean of AA) ranged from 0.247 (apples) to 0.988 (beef tenderloin). The median TID of AA was high (mean of AA>0.90) for foods categorised as dairy products, eggs, fish and seafood, isolates and concentrates, meat, nuts, plant-based burgers, soy products and wheat products. Food categories with median TID below 0.80 were baked products, fruit, pulses and seeds, and wheat bran cereal, yeast and zein. Food categories with low variations between foods were fish and seafood (1%units), dairy products (3%units) and eggs (5%units) whereas categories with the greatest variation were grains (18%units), vegetables (16%units), seeds (14%units) and fruit (12%units). There was considerable variation in TID for individual AA both within and among foods. The database with TID of AA of 97 foods generated by three laboratories using a standardised methodology can be utilised for protein quality evaluation."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40808560/", "title": "Replacement of soya DOC with rice DDGS and its effect on performance, nutrient metabolizability, carcass traits and gut health of broiler chicken.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-12T00:00:00+00:00", "quality_score": 0.573, "relevance": 0.3285, "tags": [], "text": "Replacement of soya DOC with rice DDGS and its effect on performance, nutrient metabolizability, carcass traits and gut health of broiler chicken. Replacement of soya DOC with rice DDGS and its effect on performance, nutrient metabolizability, carcass traits and gut health of broiler chicken. - The study was conducted to utilize rice DDGS as a protein source in broiler chicken. - Three hundred day old straight run commercial broiler chicks were divided into five groups of four replications each and fed as CG control receiving standard basal diet; 15-RDDGS with 15 percent rice DDGS; 15-RDDGSE with 15 percent rice DDGS supplemented with protease enzyme @ 300g/ton of feed; 20-RDDGS with 20 percent rice DDGS and 20-RDDGSE with 20 percent rice DDGS supplemented with protease enzyme @ 300g/ton of feed. - The final body weights were significantly (p<0.01) higher and FCR was significantly better for CG and comparable with 15-RDDGS and 15-RDDGSE. The CP metabolizability, was significantly (p<0.05) higher for CG than 15 and 20 percent rice DDGS groups, however the CP metabolizability for protease supplemented 15 and 20 percent rice DDGS group was comparable with control diet. The total viable count (TVC) and E-coli count revealed non-significant differences. There was no negative impact on histological changes in intestine due to inclusion of rice DDGS. There was no negative impact on histological changes such as crypt depth, villus width and villus height in intestine due to interaction between DDGS and enzyme. The carcass traits revealed non-significant differences for dressing percentage, overall giblet weight and abdominal fat. - It was concluded that rice DDGS can be incorporated upto 20 levels in broiler diet without any adverse effect, however inclusion of 15 percent rice DDGS supplemented with protease enzyme proved to be more economical in broilers."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40806155/", "title": "Effect of Plant-Based Proteins on Recovery from Resistance Exercise-Induced Muscle Damage in Healthy Young Adults-A Systematic Review.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-07T00:00:00+00:00", "quality_score": 0.5716, "relevance": 0.3505, "tags": ["whey", "plant", "athletes"], "text": "Effect of Plant-Based Proteins on Recovery from Resistance Exercise-Induced Muscle Damage in Healthy Young Adults-A Systematic Review. Effect of Plant-Based Proteins on Recovery from Resistance Exercise-Induced Muscle Damage in Healthy Young Adults-A Systematic Review. Plant-based protein supplementation in supporting muscle recovery following resistance exercise remains an area of growing interest, particularly among vegan athletes, as a potential alternative to animal-based proteins. This systematic review aimed to evaluate the effectiveness of plant-based proteins on recovery from resistance exercise-induced muscle damage in healthy young adults. A systematic and comprehensive search was administered in eight databases up to 1 May 2025, identifying 1407 articles. Following deduplication and screening, 24 studies met the eligibility criteria, including 22 randomized controlled trials and 2 non-randomized studies, with the majority from high income western countries. Interventions primarily involved soy, pea, rice, hemp, potato, and blended plant protein sources, with doses ranging from 15 to 50 g, typically administered post resistance exercise. Outcomes assessed included muscle protein synthesis (MPS), delayed-onset muscle soreness (DOMS), inflammatory biomarkers, muscle function, and fatigue. The review findings reaffirm that single-source plant proteins generally offer limited benefits compared to animal proteins such as whey, particularly in acute recovery settings, a limitation well-documented consistently in the literature. However, our synthesis highlights that well-formulated plant protein blends (e.g., combinations of pea, rice, and canola) can stimulate MPS at levels comparable to whey when consumed at adequate doses (â‰¥30 g with ~2.5 g leucine). Some studies also reported improvements in subjective recovery outcomes and reductions in muscle damage biomarkers with soy or pea protein. However, overall evidence remains limited by small sample sizes, moderate to high risk of bias, and heterogeneity in intervention protocols, protein formulations, and outcome measures. Risk of bias assessments revealed concerns related to detection and reporting bias in nearly half the studies. Due to clinical and methodological variability, a meta-analysis was not conducted. plant-based proteins particularly in the form of protein blends and when dosed appropriately, may support muscle recovery in resistance-trained individuals and offer a viable alternative to animal-based proteins. However, further high-quality, long-term trials in vegan populations are needed to establish definitive recommendations for plant protein use in sports nutrition."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40811971/", "title": "The digestibility of rapeseed protein isolate prepared by salt and alkali extraction: The importance of protein composition.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-07T00:00:00+00:00", "quality_score": 0.5685, "relevance": 0.3442, "tags": ["quality"], "text": "The digestibility of rapeseed protein isolate prepared by salt and alkali extraction: The importance of protein composition. The digestibility of rapeseed protein isolate prepared by salt and alkali extraction: The importance of protein composition. In this study, four rapeseed protein extracts were prepared from intact/dehulled rapeseed using salt and alkaline extraction. Their nutritional quality was assessed and linked to protein composition through 4D label-free proteomics. Salt-extracted protein isolates had lower glucosinolate (0.47 Î¼mol/g) and phytic acid (0.59 %) content than the alkaline-extracted protein isolates, whereas the alkaline-extracted isolates demonstrated higher digestibility (93 %). The inconsistency between the trend of non-protein anti-nutritional factors and protein digestibility suggests that protein composition may play a more significant role than anti-nutritional factors. Proteomic analysis showed that both extraction methods yielded similar globulin (cruciferin) abundance, but the salt-extracted isolate contained more protein anti-nutritional factors, including albumin (napin) and other protease inhibitors. These findings highlight the importance of protein composition in determining digestibility, showing the need for a protein composition-based approach in evaluating (plant) protein digestibility."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40814083/", "title": "Relationship between dietary protein intake and serum essential free amino acid concentrations in Japanese pregnant women: an observational study.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-14T00:00:00+00:00", "quality_score": 0.5665, "relevance": 0.3053, "tags": [], "text": "Relationship between dietary protein intake and serum essential free amino acid concentrations in Japanese pregnant women: an observational study. Relationship between dietary protein intake and serum essential free amino acid concentrations in Japanese pregnant women: an observational study. Insufficient protein intake decreases serum free amino acid (FAA) concentrations and worse whole-body nutritional status, leading to poor pregnancy outcomes. Protein can be obtained from various dietary sources and differs in amino acid composition. However, it remains unclear whether FAA patterns and nutritional status are influenced by differences in dietary protein sources. Therefore, this study aimed to explore the relationship between serum FAAs, type of protein source intake, and protein nutritional status to improve diet during pregnancy. In this secondary analysis of data from an observational study of pregnant Japanese women ( Serum FAA concentrations were significantly positively correlated with animal protein intake. Weight-adjusted total and animal protein intakes in the first tertile (T1) of the reduced albumin (Alb) ratio were significantly lower than those in the second and third tertiles (T2-3). Tryptophan concentrations in the second and third trimesters of pregnancy were significantly positively correlated with the reduced Alb ratio. Threonine in T1 of the reduced Alb ratio was significantly lower than that in T2-3 in the second trimester. Individual FAA concentrations during pregnancy are affected differently according to the dietary protein source and intake. The intake of animal proteins is effective in maintaining essential FAAs during pregnancy. Protein deficiency may lead to decreased concentrations of serum tryptophan, threonine, and protein nutritional biomarkers. Identifying a proper strategy for ensuring adequate protein intake may contribute to healthy birth outcomes. Inadequate protein intake decreases serum free amino acid concentrations, leading to poor overall nutritional status and poor pregnancy outcomes. Animal protein intake and reduced albumin, a novel indicator of protein nutrition, were significantly associated with serum tryptophan and threonine concentrations. Animal protein intake is effective in maintaining essential free amino acid concentrations during pregnancy and may contribute to healthy birth outcomes. Trp, tryptophan; Thr, threonine; Phe, phenylalanine; Met, methionine; Lys, lysine; BCAAs, branched-chain amino acids; His, histidine. [Image: see text] The online version contains supplementary material available at 10.1186/s12884-025-07962-w."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40806046/", "title": "Protein and Aging: Practicalities and Practice.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-07-28T00:00:00+00:00", "quality_score": 0.5661, "relevance": 0.385, "tags": ["plant", "timing", "athletes"], "text": "Protein and Aging: Practicalities and Practice. Protein and Aging: Practicalities and Practice. Dietary protein is an essential macronutrient derived from both plant and animal sources required for muscle building, immune function, and wound healing. However, in the United States, protein consumption worsens as individuals age, with 30% of men and 50% of women over 71 consuming inadequate dietary protein due to a variety of factors, including changes in gut function, loss of appetite, tooth loss, financial concerns, and social isolation. The aim of this review is to underscore the need for increased protein requirements in aging populations, highlight potential barriers, synthesize these protein requirements, and also recommend strategies to meet these increased protein needs. Achieving adequate protein status, especially when facing chronic or acute health concerns, is essential to promote muscle and bone strength (because aging is associated with significant decreases in postprandial muscle protein synthesis), to support immune health (due to immunosenescence), and to maintain a good quality of life. For older adults, the literature suggests that a dietary protein intake of at least 1.0-1.2 g/kg/day is required in healthy, aging populations, and intakes of 1.2-1.5 g/kg/day are necessary for those with chronic or acute conditions. These protein intake recommendations can increase to 2.0 g/kg/day in more severe cases of illness, malnutrition, and chronic conditions. The reviewed literature also suggests that evenly balanced protein distributions of 25-30 g of dietary protein (0.4 g/kg) per meal from animal and plant protein sources alike are sufficient to maximize muscle protein synthesis (MPS) rates in older populations. Additionally, pre-sleep protein feeds of 40 g/night may be another strategy to improve daily MPS and amino acid utilization."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40783689/", "title": "Efficacy of progressive resistance training intensities and adequate dietary protein intake for community-dwelling frail older adults (TEAMS study), protocol for a randomised controlled trial.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-09T00:00:00+00:00", "quality_score": 0.5627, "relevance": 0.323, "tags": ["athletes"], "text": "Efficacy of progressive resistance training intensities and adequate dietary protein intake for community-dwelling frail older adults (TEAMS study), protocol for a randomised controlled trial. Efficacy of progressive resistance training intensities and adequate dietary protein intake for community-dwelling frail older adults (TEAMS study), protocol for a randomised controlled trial. Progressive Resistance Training (PRT) and adequate dietary protein are crucial for preventing and managing sarcopenia and frailty in older adults. To date, the optimal intensity of PRT and the added value of dietary protein for enhancing muscle mass, strength, and physical performance in frail older adults remain unclear. This randomised controlled trial aims to determine the efficacy of various PRT intensities and adequate dietary protein intake in improving muscle mass, strength and physical performance in frail, community-dwelling older adults. This study is a two-step randomised clinical trial involving 300 frail older adults. Participants will engage in a 12-week PRT twice weekly. Initially, participants will be randomised to specific training intensities, ranging from 20 to 80% of their one-repetition maximum (1-RM). Subsequently, participants will be further randomised into two groups: an intervention group receiving a dietary intervention targeting a daily protein intake of 1.2-1.5 g/kg/day (PRT-Pro), and a control group with no dietary intervention (PRT-only). The dietary protein intervention will include counselling sessions and the provision of protein-rich foods. This study aims to elucidate the effect of various PRT intensities and the supplementary effects of adequate dietary protein intake on muscle mass, muscle strength, and physical performance in frail older adults. The results will provide critical insights for scientists and healthcare professionals, facilitating the development of more effective strategies to combat sarcopenia and frailty in this population. The trial is registered at the ICTRP (OMON trial ID NL8785)."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40808381/", "title": "Impact of supplementing different sources of non-protein nitrogen on ruminal fermentation, nutrient digestibility, and microbial protein synthesis in beef cattle consuming a corn silage-based diet.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-12T00:00:00+00:00", "quality_score": 0.5603, "relevance": 0.3031, "tags": ["quality"], "text": "Impact of supplementing different sources of non-protein nitrogen on ruminal fermentation, nutrient digestibility, and microbial protein synthesis in beef cattle consuming a corn silage-based diet. Impact of supplementing different sources of non-protein nitrogen on ruminal fermentation, nutrient digestibility, and microbial protein synthesis in beef cattle consuming a corn silage-based diet. Supplementation of low-protein diets with non-protein nitrogen (NPN) increases ruminal degradable protein and improves rumen fermentation and microbial growth. The objective of this experiment was to evaluate the effect of supplementing urea-biuret (UB) and urea-biuret-nitrate (UBN) mixtures relative to urea (U) on rumen fermentation and microbial N outflow in growing steers. Twelve American Aberdeen steers were used in a replicated and balanced 3 Ã— 3 Latin square design (LSD) with three periods of 35 days each. Steers were housed in pens and consumed a corn silage-based diet. Steers were stratified by body weight and randomly allocated to one of the three NPN supplementation treatments. Treatments were supplementation with U, UB, and UBN, adjusted to the amount of N provided by U when included at 1% of the diet on a dry matter (DM) basis. Intake and feeding behavior were individually recorded throughout the experiment. In each period, steers were adapted to increasing levels of NPN during the first 8 days. From day 19 to 23, feed and fecal samples were collected to assess nutrient digestibility. Samples of blood, rumen contents, and omasal digesta were collected on d 20 to 23. On d 24, rumen evacuation was performed and subsequently steers were dosed with Co-EDTA and YbCl3 to determine the passage rate of digesta flow. Rumen fluid collection was conducted on d 24 and 25. Steers did not receive NPN supplementation from day 26 to 35 during the washout period. Microbial N flow was estimated for each animal within periods. Intake, digestibility, digesta flow, and microbial N flow were analyzed using a 3 Ã— 3 LSD, while blood and rumen fermentation parameters were analyzed using a 3 Ã— 3 LSD with repeated measures. Steers supplemented with UB tended (P < 0.07) to consume more DM and organic matter (OM) than those supplemented with UBN; however, animals supplemented with UBN tended (P = 0.051) to digest more acid detergent fiber in the total tract. Steers supplemented with U and UB showed greater (P < 0.05) DM and OM flow throughout the omasum than those with UBN. Microbial N flow, microbial efficiency, and the concentration of total volatile fatty acids were not different (P > 0.10) among NPN-supplemented treatments. Steers supplemented with UBN showed lesser (P < 0.05) concentration of ammonia than those with U and UB. In conclusion, novel NPN mixtures have the potential to modify ruminal fermentation without affecting microbial protein outflow."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40807667/", "title": "Effect of Hemp Protein and Sea Buckthorn Extract on Quality and Shelf Life of Cooked-Smoked Sausages.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-05T00:00:00+00:00", "quality_score": 0.5498, "relevance": 0.3164, "tags": ["plant"], "text": "Effect of Hemp Protein and Sea Buckthorn Extract on Quality and Shelf Life of Cooked-Smoked Sausages. Effect of Hemp Protein and Sea Buckthorn Extract on Quality and Shelf Life of Cooked-Smoked Sausages. Modern meat processing faces several challenges, including high resource consumption, environmental impact, and the need to enhance the nutritional and biological value of finished products. In this context, interest is growing in functional plant-based ingredients capable of improving the quality of meat products. The aim of this study was to evaluate the effect of adding 0.01% hemp protein powder and 0.01% sea buckthorn extract (based on the weight of unsalted raw material) on the nutritional, technological, and microbiological characteristics of cooked-smoked sausages. The results demonstrated an increase in total protein content, a 2.5-fold rise in tocopherol levels, as well as a 17.9% improvement in the Amino Acid Score of threonine and a 2.48% increase in the biological value of protein. Samples enriched with plant-based components exhibited enhanced organoleptic properties and greater storage stability over 36 days. In addition, extrusion parameters for the production of the protein additive were optimized, resulting in a stable functional ingredient."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40816209/", "title": "Long-term risk of overweight/obesity according to the protein quality index in a prospective middle-aged cohort.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-07-30T00:00:00+00:00", "quality_score": 0.5479, "relevance": 0.3398, "tags": [], "text": "Long-term risk of overweight/obesity according to the protein quality index in a prospective middle-aged cohort. Long-term risk of overweight/obesity according to the protein quality index in a prospective middle-aged cohort. An adequate quality of protein intake is important for body weight management and for preventing overweight/obesity. However, beyond the source of protein, there is limited evidence on other dimensions of protein quality which may contribute to these goals. To investigate the association between the quality of dietary protein intake and long-term weight changes including the incidence of overweight/obesity. We prospectively assessed middle-aged participants (37.4 Â± 12.4 years) in the Seguimiento Universidad the Navarra cohort prospective cohort, using data from the 2022 dataset. Primary exposure was the multidimensional Protein source Quality Index (PQI), a previously defined metric ranging from 0 to 39.5, categorized into four levels based on cut-off points of 0.5, 1, and 2. The PQI encompasses multiple components: the types of protein-rich food sources, their essential amino acid composition, the healthfulness of these sources according to international dietary guidelines, and their impact on climate. Multivariable-adjusted associations (linear mixed models and Cox proportional hazard ratios) were examined between baseline PQI and two outcomes: long-term weight changes over an 18-year follow-up period, and the incidence of overweight and obesity. Among 12,908 participants with an initial body mass index <25 kg/m Our results suggest that a high PQI could be inversely associated with the incidence of overweight/obesity in a cohort of middle-aged adults and highlight the substantial role of PQI in long-term weight management. NCT02669602 (https://clinicaltrials.gov/study/NCT02669602?term=SUN&locStr=Spain&country=Spain&rank=4)."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40787814/", "title": "Effect and Mechanism of Whey Protein Isolate-Epigallocatechin Gallate Non-Covalent Complex on Skeletal Muscle Attenuation in Aging Mice.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-01T00:00:00+00:00", "quality_score": 0.5465, "relevance": 0.3282, "tags": ["whey", "quality"], "text": "Effect and Mechanism of Whey Protein Isolate-Epigallocatechin Gallate Non-Covalent Complex on Skeletal Muscle Attenuation in Aging Mice. Effect and Mechanism of Whey Protein Isolate-Epigallocatechin Gallate Non-Covalent Complex on Skeletal Muscle Attenuation in Aging Mice. With the increasing aging population, there is a growing concern regarding the impact of skeletal muscle decay on the quality of life of the elderly. In this study, the anti-sarcopenia effect of the whey protein isolate-epigallocatechin gallate (WPI-EGCG) complex and its underlying mechanisms were investigated using a D-galactose induced senescence C2C12 cell model and skeletal muscle sarcopenia mouse model. The results showed that the optimal preparation conditions of the complex were pH 5.5, reaction time 1.5 h, and WPI:EGCG = 1:2.5. Under this condition, the DPPH free radical scavenging rate of the complex was 71.61%, and the protein digestibility was 80.95%. Compared with WPI, the antioxidant activity of the complex was significantly increased by 66.23%, and the protein digestibility was significantly decreased by 5.39% (p < 0.05). After the intervention with 0.32 mol/L and 0.16 mol/L D-galactose, the cell proliferation rate of 4.0 mg/mL WPI-EGCG complex treatment was significantly increased by 63.81% and 69.92% compared with the model group (p < 0.05), respectively. In addition, gavage of a low dose WPI-EGCG complex (250 mg/kg/d.bw) significantly increased skeletal muscle mass index (SMI) and muscle cross-sectional area (p < 0.05), and improved muscle mass and muscle fiber morphology in the sarcopenia mouse model compared with the model group. Compared with the model group, the low-dose WPI-EGCG complex significantly increased SOD activity by 16.14% and decreased 8-hydroxydeoxyguanosine (8-OHdG) content by 17.18% (p < 0.05), which was beneficial to reduce the oxidative stress level of mice. In addition, the protein expression of PI3K was increased after gavage of a low dose WPI-EGCG complex compared with the model group. After gavage of a high dose of the WPI-EGCG complex, the expression of AKT and mTOR protein was significantly increased compared with the model group (p < 0.05). In conclusion, the WPI-EGCG complex ameliorated the inhibitory effect of D-galactose on protein synthesis in mouse skeletal muscle by up-regulating the phosphorylation levels of PI3K, AKT, and mTOR proteins. It can promote protein anabolism in the skeletal muscle of mice, thereby improving aging-induced skeletal muscle decay. It provided new ideas for improving skeletal muscle health and quality of life in the elderly."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40782637/", "title": "Peptidomics and molecular docking reveal digestion-resistant IgE-binding epitopes in bovine Î²-lactoglobulin and Î±-lactalbumin from simulated infant digestion.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-08-06T00:00:00+00:00", "quality_score": 0.5457, "relevance": 0.3033, "tags": ["whey"], "text": "Peptidomics and molecular docking reveal digestion-resistant IgE-binding epitopes in bovine Î²-lactoglobulin and Î±-lactalbumin from simulated infant digestion. Peptidomics and molecular docking reveal digestion-resistant IgE-binding epitopes in bovine Î²-lactoglobulin and Î±-lactalbumin from simulated infant digestion. Î²-Lactoglobulin (BLG) and Î±-lactalbumin (ALA) are the primary allergens in whey protein. However, gastrointestinal digestion can induce structural rearrangements of their IgE-binding epitopes, complicating the precise evaluation of allergenicity. This study developed a novel approach to identify digestion-resistant antigenic epitopes of BLG and ALA through simulated in vitro infant digestion. A peptidomics approach based on mass spectrometry, combined with high-throughput molecular docking, was employed to predict peptide interactions with the IgE fragment of antigen binding. Seven antigenic epitopes and 22 key amino acids were identified from BLG-derived peptides, and five antigenic epitopes and 18 key amino acids were identified from ALA-derived peptides. The allergenicity of synthetic epitopes ranged from 40 % to 80 %, and the dissociation constant between epitopes and IgE ranged from 17.90 nM to 279.01 nM, confirming their strong IgE-binding potential. Notably, this synergistic integration of computational prediction and experimental validation establishes a paradigm for characterizing digestion-resistant antigenic epitopes."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40806085/", "title": "Behavioral and Proteomics Studies on the Regulation of Response Speed in Mice by Whey Protein Hydrolysate Intervention.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-07-30T00:00:00+00:00", "quality_score": 0.5438, "relevance": 0.3317, "tags": ["whey"], "text": "Behavioral and Proteomics Studies on the Regulation of Response Speed in Mice by Whey Protein Hydrolysate Intervention. Behavioral and Proteomics Studies on the Regulation of Response Speed in Mice by Whey Protein Hydrolysate Intervention."}
{"url": "https://www.reddit.com/r/veganfitness/comments/1mua134/pdcaas_should_i_worry/", "title": "PDCAAS - should I worry ?", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-19T05:46:48+00:00", "quality_score": 0.5436, "relevance": 0.379, "tags": ["whey"], "text": "PDCAAS - should I worry ? Title: PDCAAS - should I worry ? Post: Hi guys ! I'm not sure if you're aware of the % DV reflecting protein adjusted for PDCAAS scores, but I just found out that one of the protein powders I use - sunwarrior brown rice - only lists 16% DV per 20g when it should be 40%?! Plus warrior blend shows only 25% per 17g protein when it should be 34%?! This is the case for many plant proteins !! I've yet to find one that match the actual DV :( I am very baffled and overthinking - did I waste my money ? SW claims complete proteins, but it is not reflected in the DV ? I thought I'd been getting 90-100g protein per day, but it might be 60-70g in actuality ? Makes sense given my serum protein markers have been falling lately, ever since I switched to SW brown rice from pea (in an attempt to reduce iron - I have high ferritin) :(. Do you guys track these? Should I just focus on total grams instead of the % DV ? Does it matter whether they are \"complete\" if I get sufficient protein / varied sources throughout the day ? Gahh really stressing. Comments: Itâ€™s literally noise that doesnâ€™t matter at all if eating a varied diet. Hit your target, stop going crazy over fearmongering content. itâ€™s not that bad if you eat a varied diet but if youâ€™re really particular (as am I tbh) check out brands like Whey Foward (whey from plants ðŸŒ±), Spacemilk (yeast based protein)and Leaft (Rubisco protein) ! How is your fitness progress?"}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40807576/", "title": "Comprehensive Review of Alternative Proteins in Pet Food: Research Publications, Patents, and Product Trends in Plant, Aquatic, Insect, and Cell-Based Sources.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-07-28T00:00:00+00:00", "quality_score": 0.5374, "relevance": 0.3275, "tags": ["quality"], "text": "Comprehensive Review of Alternative Proteins in Pet Food: Research Publications, Patents, and Product Trends in Plant, Aquatic, Insect, and Cell-Based Sources. Comprehensive Review of Alternative Proteins in Pet Food: Research Publications, Patents, and Product Trends in Plant, Aquatic, Insect, and Cell-Based Sources. The increasing demand for sustainable pet-food solutions has driven interest in alternative protein sources, as researchers seek to avoid allergenic foods while maintaining optimal pet nutrition. This review explores recent scientific publications, patent trends, and market trends relating to various alternative protein sources, including plant-based, aquatic, insect-derived, and cell-based sources. Their nutritional composition, functional properties, and potential benefits for pet health were assessed. Plant-based proteins, such as soy, pea, and lentils, provide essential amino acids and functional properties suitable for meat analogues. Microalgae and seaweed offer rich sources of omega-3 fatty acids, antioxidants, and bioactive compounds. Insect-based proteins such as black-soldier-fly larvae and mealworms are highly digestible and rich in essential nutrients, with additional benefits for gut health. Emerging cell-based proteins present a novel, lab-grown alternative with promising sustainability and nutritional advantages. While these protein sources offer significant benefits, challenges related to digestibility, palatability, regulatory approval, and consumer acceptance must be addressed. The emphasis of the present research is on current developments for industry uses and future potential. The analysis sheds light on the contributions of alternative protein sources to the promotion of sustainable and nutrient meals for pets."}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40806033/", "title": "Sustainable Nutrition and Food Allergy: A State-of-the-Art Review.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-07-27T00:00:00+00:00", "quality_score": 0.5368, "relevance": 0.3306, "tags": ["safety"], "text": "Sustainable Nutrition and Food Allergy: A State-of-the-Art Review. Sustainable Nutrition and Food Allergy: A State-of-the-Art Review. Alternative proteins denote non-traditional, high-protein foods. These innovative sources aim to compete with conventional animal products by providing protein-rich, sustainable, nutritious, and flavorful options. Currently, five main categories of alternative proteins are being developed: plant-based proteins, cultured meat, single-cell proteins, edible insects, and seaweed. Nonetheless, several chemical and microbiological food safety hazards are associated with these alternatives Incorporating novel protein sources into food products may heighten the prevalence of existing food allergies. This could arise from extracting proteins from their natural matrices and utilizing them at significantly higher concentrations. Additionally, the introduction of new proteins may lead to the development of novel food allergies. Proteins that are currently seldom or never consumed may cause primary sensitisation or trigger cross-reactivity with known allergens. To date, alternative proteins have not been thoroughly studied for their allergenic potential, and there is no standardised method for assessing this risk. This review aims to explore non-traditional protein sources, discussing their nutritional and functional properties, as well as their potential allergenicity based on available research. We conducted a literature search in PubMed and Embase databases. We used specific keywords and MESH terms. A total of 157 studies were included in the review. The studies reviewed in our analysis reveal significant limitations, such as inconsistent methodologies, limited participant numbers, and a lack of long-term data, which hinder the ability to make clear conclusions regarding the safety of these new proteins for individuals with allergies. To address current challenge, future research should integrate food science, regulatory perspectives and advanced technologies."}
{"url": "https://www.reddit.com/r/nutrition/comments/1mtvcbr/how_does_protein_intake_work/", "title": "How does protein intake work?", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-18T19:07:51+00:00", "quality_score": 0.5325, "relevance": 0.3503, "tags": ["athletes"], "text": "How does protein intake work? Title: How does protein intake work? Post: I'm mainly interested for building muscle. Let's say you are hitting your calorie goal and also your workout and regeneration is on-spot. How does protein ammount affect your progress and results? Let's say 1.6g/bodyweight is optimal. But what if you take less? Will your progress slow down? Will you be able to achieve the same muscle mass and size just slower? Or there will be a point where you won't be able to build muscle without increasing protein? Like what would happen in the scenarios if i took less protein instead of 1.6g: \\- 1.5g \\- 1.4g \\- 1.3g \\- 1.2g \\- 1.1g \\- 1g Comments: Itâ€™s not just about progress, but itâ€™s also about recovery. Your skeletal muscles only make up 40-50% of your lean body mass (LBM) The remaining 50-60% of your LBM tissues have just as much protein requirements or higher. Itâ€™s important not to neglect protein intake You can check out this site for a lot more info [Optimal Protein Intake Guide & Calculator](https://examine.com/guides/protein-intake/?srsltid=AfmBOopukHOrhGXhf1LC2bGj4t5aXjJ5oBX9POpJzJAL34BYBXoaW-9u) As for **minimum** protein intake, most organizations say ~1.4g/kg for average bodyfat individuals and ~1.2g/kg for overweight individualsâ€¦.if they have strength/hypertrophy goals I covered the research [**HERE**](https://www.reddit.com/r/nutrition/s/dUFtUMBerd) If youâ€™re average bodyfat, I recommend 2.0-3.0g/kg. You can see the post on my profile for my reasoning #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* Think of protein like fuel for building muscle. The 1.6g/kg target is where studies show youâ€™re pretty much maxing out growth. If you dip a bit under, like 1.5â€“1.3g, youâ€™ll still build muscle just fine â€” progress might be a touch slower but nothing dramatic. Once you get closer to 1.2g and below, youâ€™re leaving more gains on the table because your body has less raw material for repair and growth. At 1g/kg you can still make progress if calories and training are solid, but it wonâ€™t be as efficient and youâ€™ll likely cap out sooner. So small drops = slower progress. Big drops = noticeable limit on how much muscle you can add. Several studies show that higher protein intake generally means higher increase in lean muscle mass, however the returns are diminishing past a certain point. Generally, if you eat more protein while working out you will fain more LMM. Put simply, if you eat 10% more protein than optimal, you might gain 8% more LMM. If you eat 20% more protein, you might gain 11% more LMM. The numbers are not accurate, just simple examples. With the recent studies in cytokines, protein may be even more important than previously thought. You can easily up your protein for better gains *and* better health, as long as it doesn't stop you from getting other important nutrients. As always, focusing on a varied diet with different sources of protein, fiber and nutrients is preferred and should be goal n1. Going for high protein is obviously necessary for gaining muscle mass, but getting enough fiber and nutrients is just as important."}
{"url": "https://www.reddit.com/r/nutrition/comments/1mp3vqy/how_does_protein_effect_a_wourkout_timewise/", "title": "How Does Protein Effect a Wourkout Time-wise?", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-13T13:04:26+00:00", "quality_score": 0.5304, "relevance": 0.3528, "tags": ["timing", "athletes"], "text": "How Does Protein Effect a Wourkout Time-wise? Title: How Does Protein Effect a Wourkout Time-wise? Post: I will preface this by saying that I understand that a constant good diet and constant workout/exercise is best. I am asking just to better understand how the protein helps. If I were to work out one time, and have only one day that i have a high protein meal, would it be best to have that meal the night before a workout, the day of the workout, or the day after the workout? So im asking if its the protein already in your system (day before), or the protein that's starting digestion (day of), or the protein while sore and in recovery (day after), that has the largest effect on muscle growth? Again, im asking solely to understand how protein actually affects muscle growth, not looking to only eat protein once every 3 days or looking for diet advice, thanks! Comments: Barely matters at all as long as you supply your body with enough of all the amino acids it needs. The most important factor that determines the hypertrophy you're going to get is whether or not your workout created the molecular signal to trigger hypertrophy, and that's going to be much more dependant on your glycogen status (how depleted or glycogen loaded you are), which is going to impact your performance and thus the hypertrophy stimulus you can generate, and your carbohydrate intake is going to determine this (obviously depends on a variety of other factors not related to diet). If you create the stimulus and the protein is there, the fibers must and will grow Protein timing has a teeny tiny impact on growth, it's mostly marketing and nerd min/maxing. If you can have a shake post work out, do it. If not, it's not worth changing your day to make it happen. So itâ€™s very complicated and itâ€™s impossible to say exactly whatâ€™s happening, but probably easiest to think of it this way: The total amount of protein per day you have is your stored protein. That is what is used for everything, not just muscles but all the body processes. Itâ€™s very important for muscle growth that the body never has to ration that out, so you want to consistently eat adequate protein. Muscle growth is one of the first things to get cut. The timing of that protein is just a signal. When the body sees itâ€™s getting a big chunk of protein (varies a lot Ill go over this) then it says â€œok boys weâ€™re in the green letâ€™s partyâ€, and it stimulates MPS (muscle protein synthesis) which is a big boost to your gains. This lasts for around 4-6 hours Unfortunately it gets a lot more complex than that. Thereâ€™s a limit to that MPS effect, if you â€œspikeâ€ it too many times, the spikes will decrease, and youâ€™ll end up at about the same spot, or in some cases youâ€™ll have lower MPS. 3-4 protein feedings a day seems to be the sweet spot, but weâ€™re talking fractions of a percent of difference in the 2-6 window So, overall, the message is what it always. Eat a normal amount of meals, a decent chunk of protein, youâ€™re good to go. Now, one thing thatâ€™s gotten some really research is age and how it affects MPS. It seems that children have MPS that is super powered. They will be fully stimulated with ~8g of protein. Thatâ€™s why youâ€™ll see kids who eat nothing but crackers and pasta and theyâ€™re not withered away. On the other end of that, 60+ year olds might neeed as much as 45-50g for the full effect. So, we see a spectrum here, and that means we probably should be more focused on protein feedings as we age. Protein reqs might rise slightly as well, but the MPS seems to be the big factor here. Yeah the effect of timing is really very minimal. I like thinking of my dietary timescale in terms of weeks, rather than days or even hours, and that helps me to both relax when I have a not-great day, but also to look for my progress that happens over months rather than in a week or two. Most people in the western world simply don't exercise enough for muscle growth (2 days per week - every week - of moderately heavy resistance training is bare minimum IMO with something like 4 being much better). Likewise, they also don't eat enough protein for muscle growth either. So if your weekly average protein intake is high enough, you are going to reap like 90% of the benefits that the daily person doesn't - without even having to care about if you drank your shake at breakfast, or just after your workout, etc. You can't \"overdose\" on protein. Your body doesn't discard \"excess\" protein. Eat 1g of protein per lb of body weight (or ideal body weight if you're overweight/obese) and try to hit that target as you eat throughout the day. Your body will do the rest. Itâ€™s good to have circulating amino acids in your system during your workout. Pre workout nutrition is better than post workout nutrition because of the performance aspect. The â€œAnabolic Windowâ€ doesnâ€™t really exist You can read the [Pre-workout section in my Bulking article](https://originsymmetrics.com/how-to-properly-bulk/#Nutrition_around_workout) to see how much to eat and when Also, everyday your protein intake should be high/sufficient. Just upping protein intake for days you workout wonâ€™t do anything. You donâ€™t build muscle in those 24 hrs [protein timing is irrelevant](https://pmc.ncbi.nlm.nih.gov/articles/PMC3879660/): >A simple pooled analysis of protein timing without controlling for covariates showed a small to moderate effect on muscle hypertrophy with no significant effect found on muscle strength. In the full meta-regression model controlling for all covariates, however, no significant differences were found between treatment and control for strength or hypertrophy. get enough protein, doesn't matter when. Effect is marginal. Eating the right macros in general and training and recovering well are the main drivers. This timing stuff is minimaal and also itâ€™s not all fully clarified by science because we speak about complex processes that also depend on context (eg. Have you slept well, are you stressed or not, how your gut bacteria are doing etc). So probably thereâ€™s A tiny difference. But practically its way more bang for your huck to focus on other things for progress. #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* Protein timing isnâ€™t magic. What matters is total daily intake, but if you had to pick, the day of and after the workout are when your bodyâ€™s repairing muscle"}
{"url": "https://i.redd.it/nlfrf4ouusjf1.jpeg", "title": "Need help", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-18T15:51:42+00:00", "quality_score": 0.5225, "relevance": 0.3145, "tags": ["athletes", "weight_loss"], "text": "Need help Title: Need help Post: I am a 17 year old male i am 6,4- 6,5 and i weigh 139 pounds i want to gain some more weight but my fast metabolism makes this very had i play basketball so getting a bigger body would help me to take more contact and i also want to get a fuller body look as i look a bit lanky and i was looking into protein powers and i found this one does anyone have any recommendations for me to gain my desired body size Comments: This is creatine, not protein powder. Regular creatine intake can help to add water weight to your muscles which can provide a fuller look and more energy during workouts. Creatine does not make you gain muscle mass, but it is an excellent supplement to help support muscle growth through more efficient workouts when combined with a proper diet and training regimen. Why donâ€™t you Google â€˜creatine monohydrateâ€™? Itâ€™s a proven supplement with all the information youâ€™d ever need. *also keep in mind this is not a protein powder. Thereâ€™s zero protein in this. A couple of things here. 1) This isn't protein powder, it is creatine. It is a useful supplement, but it's not protein. 2) Protein powder won't make you gain weight. You just need more calories. If you want a lazy way to do this, you could look at mass gainer powders which are basically protein powders with a lot of extra carbs to increase calories. The better way to do it would just be with more food. Calorie dense things like peanut butter, almonds, oils, etc. are the easiest and healthiest way. 3) If you're going to be gaining weight as an athlete, you probably want to also be lifting weights. Otherwise the weight you gain will be mostly fat. This is not a protein powder, itâ€™s creatine. It will help you pack on some water weight around your muscles. Itâ€™s a good supplement to take but you should find a vegan gainer or protein powder as well. Creatine is an awesome supplement, but not a weight gainer. You need to eat in a surplus. I'd suggest joining the r/gainit sub. Ah. I know the feeling. Once you hit your 30s you'll find it easier to gain mass lol. Back in the days, I took Prolabs nLarge2 and Garnells weight gainer, that was before I went vegan though so not sure what's out there. Slow down and research better and longer my friend. It will be your best bet if you thought this was protein. Luckily if you have the money take a low dose of creatine and look up what protein is, amino acids, different protienâ€™s and make a good informed choice that way ðŸ‘ I believe in you lol. Mass gainer, thereâ€™s some that are 1000 calories So Iâ€™m 6.2â€ and was a semi pro endurance athlete got down to 2% body fat at 135lbs felt sick all the time and super fast metabolism too. Could never get enough food butâ€¦â€¦. Had no idea how to eat right back then. Given your sport and height and weight I would try to find a plant based sports nutritionist to get you on a program eating a lot more nutritionally dense foods. You may ultimately need to wait for some years for your metabolism to slow down but having a good nutrition plan should help. Wishing you all the best. Iâ€™m now 185 and best shape in my life so if I can get there so can you it may just take time Creatine is fine, but look into mass gainers and eat more low satiety foods like croissants and fruit juices. Fruit juice and gatorade during and around your basketball sessions will also help with a caloric surplus, which will help you grow. Edit: look into organic fruit juices if possible. I like pure orange juice"}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40818344/", "title": "Effect of ultrasound pretreated drying on functional and nutritional attributes of soy protein isolate: A comparative study with freeze, spray and oven-drying methods.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-07-23T00:00:00+00:00", "quality_score": 0.5172, "relevance": 0.308, "tags": ["plant"], "text": "Effect of ultrasound pretreated drying on functional and nutritional attributes of soy protein isolate: A comparative study with freeze, spray and oven-drying methods. Effect of ultrasound pretreated drying on functional and nutritional attributes of soy protein isolate: A comparative study with freeze, spray and oven-drying methods. This study examines effect of ultrasound pretreatments (5, 10, and 15 min at 350 W) and freeze-drying (FD), spray drying (SD), and oven drying (OD) on functional and nutritional properties of soybean protein isolate (SPI) powder. Results indicated that lysine was most heat-sensitive amino acid and it underwent a significant reduction in ultrasound-pretreated dried samples, with a decrease of up to 13.65 % compared to control samples. Across all drying conditions, SD is more effective in enhancing foaming stability (83.78 %-88.21 %) and reduced browning index (1.17-1.89) compared to other methods. In contrast, FD maintains a superior emulsification activity index and oil holding capacities ranging (9.83-19.21 m"}
{"url": "https://www.reddit.com/r/nutrition/comments/1mnxkje/same_protein_amount_different_dv/", "title": "Same protein amount, different DV", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-12T03:07:22+00:00", "quality_score": 0.516, "relevance": 0.3608, "tags": ["plant"], "text": "Same protein amount, different DV Title: Same protein amount, different DV Post: Saw two Mountain House pouches, both their nutrition facts labeled 20g of protein, yet one says 34% protein DV the other says 20%DV, why is it? Comments: Hey! Food scientist here who did protein testing for 3yrs. The percent DV on NFPs are calculated by PDCAAS testing (Protein Digestible Amino Acid Score). That then gets put into an equation to calculate! Different proteins have different levels. Meats will almost be the 1 (the highest score). Vegetable proteins are typically lower, but some have 1 (like soy, which is why you see soy protein a lot). Pea protein is .82, so still on the high end. https://share.google/FMtgvKZe1oHl22WaH So without knowing the formulas/recipes, my guess is they have different proteins to make up those 20g! #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* Different proteins Actually, don't know, but what I would say is: rather than relying on pouches for protein, use it as a supplement and make sure you're getting enough natural protein from meat, chicken, fish, nuts, etc. Then you will have more than you need and: 1. Feel more satiated 2. Maintain and build more muscle 3. Excess protein that isn't needed generally just gets pooped out and doesn't get stored as fat the way carbs, sugar, and fats do. So go ham on the protein, and make sure you're getting some carbs and vegetables. I think you'll be golden, regardless of whatever supplements you take."}
{"url": "https://www.reddit.com/r/nutrition/comments/1mv5oa2/how_long_does_it_take_to_see_body/", "title": "How long does it take to see body composition/muscle change from incorporating increased protein intake?", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-20T05:01:10+00:00", "quality_score": 0.5118, "relevance": 0.3062, "tags": ["athletes"], "text": "How long does it take to see body composition/muscle change from incorporating increased protein intake? Title: How long does it take to see body composition/muscle change from incorporating increased protein intake? Post: On your personal journey, how long did it take from when you started eating protein to notice body composition/muscle change?(Btw I'm aware that everyone's body is different and added protein intake might affect everyone differently based on several factors.) For me, I pretty much ate like max 10 grams of protein a day and realized this wasn't working since I'm very active. So I've switched to 60-90 grams a day. I'm not trying to be impatient but just want to get a realistic gauge of how long it should be before I see results. Thank you for your input! Comments: #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* Increased protein intake does nothing by itself, at all. the protein is there to support muscle growth otherwise it becomes fat. If you have too much protein it becomes fat. That is how the body works. If you were stalling lifting increased protein comes in to play because you're pumping it in to your muscles, but even then, you are almost always ALSO increasing fat gain. That's how a bulk works. It is not 1:1. Are you strength training? You were only eating 10g of protein a day?? Are you sure, that doesn't even seem possible Struggle to believe you only at 10g protein daily and didnt have serious health problems."}
{"url": "https://www.reddit.com/r/nutrition/comments/1maq6nn/complete_protein_collegen_tryptophan/", "title": "Complete protein? Collegen + tryptophan", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-07-27T16:10:03+00:00", "quality_score": 0.5115, "relevance": 0.4184, "tags": ["whey", "collagen"], "text": "Complete protein? Collegen + tryptophan Title: Complete protein? Collegen + tryptophan Post: Wonderful people, hello! Can I add 2 g of l tryptophan powder to 20 g of collagen peptide powder and call it good enough in order to consider my morning shake a complete protein source? I bought a bunch of collagen peptide protein powder to incorporate it into my morning shake -- as a protein source to help with recovery and muscle building -- only to later realize that it isn't a complete protein me Comments: Far from it. It is not only about tryptophan. For example the bcaa are in low amounts. You would need to take 100g and even then the quantities would be pretty small. But at that point you increase kidney stones risks among other things. And if we are talking muscle building the leucine levels in collagen is simply a joke. You are better off with almost any other incomplete vegan source. And if you consider soy that is a high quality protein assuming you enjoy it :) So, no for collagen as a complete protein. :) #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* Plenty of foods that you are likely eating already will contain tryptophan and BCAAs in various amounts. There is no real problem with supplementing collagen if it works for you. Not every meal needs to feature complete protein. You can look at the day as a whole While collagen has various potential benefits, it's a terrible P source. Mix it with something like whey or other high quality source. No. And collagen does nothing for â€œmuscle buildingâ€. It helps tendon, ligament, joint repair/recovery Most protein researchers recommend to not even count collagen toward your daily protein intake, just take 15-30g and move on"}
{"url": "https://www.reddit.com/r/veganfitness/comments/1mu5g0y/protein_without_soy_protein_powders_or_gluten/", "title": "Protein without soy, protein powders, or gluten", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-19T01:54:04+00:00", "quality_score": 0.5092, "relevance": 0.3016, "tags": ["plant"], "text": "Protein without soy, protein powders, or gluten Title: Protein without soy, protein powders, or gluten Post: Iâ€™ve been relying on soy a lot but have been trying to cut back so I end up eating a lot of beans, nuts and seeds. I also donâ€™t like protein powders or anything super processed. I love eating vegetables and would love to get a larger portion of my protein from vegetables but I know that they only have so much protein. Just trying to get some ideas. Thanks!! Comments: Any reason youâ€™re cutting back on soy? Itâ€™s like the best vegan source of protein. Thereâ€™s maybe some stuff made from mushrooms. But you have cut out pretty much the big three for vegan protein. Thereâ€™s mung bean products and a fava bean tofuâ€¦ Itâ€™s really hard to get protein without those three. Lentil pasta and chickpea pasta with generous portions of nooch could help. Protein cereals like Kashi Go Lean help a little. Fava bean tofu You can make lentil bowls with chickpeas and avocado, topped with hemp seeds or pumpkin seeds for added protein. Bean and quinoa bowls topped with hemp seeds or pumpkin seeds are also a good source of protein. If you're tired of soy based tofu, you can try making your own [lentil tofu](https://youtube.com/shorts/B3UKq41YY3s?feature=shared): [https://fit-green-mind.com/recipe-index/red-lentil-tofu](https://fit-green-mind.com/recipe-index/red-lentil-tofu) My local Sprouts sells Big Mountain Foods Fava Tofu, they have plain and sriracha flavors. I haven't tried it so I can't comment on the taste. This site has: *21 High Protein Vegan Recipes (Without Soy)* * [https://anyreasonvegans.com/high-protein-vegan-recipes-without-soy/](https://anyreasonvegans.com/high-protein-vegan-recipes-without-soy/) I know itâ€™s soy but have you tried Indonesian style tempeh? I love it. Lentils are also quite high in protein and you could combine them with veggies, they go well with spinach for example. I use Fava bean tofu, pea protein isolate, pumpkin seeds, hemp seeds, chia seeds, and flaxseed. Vegetables aren't high in protein. You should be eating beans, lentils etc. check out a brand called Leaft â€” they make protein gels from Rubisco (from leafs) Chick peas and beans"}
{"url": "https://www.reddit.com/r/nutrition/comments/1mtc09b/greek_yoghurt_overconsumption/", "title": "Greek Yoghurt overconsumption?", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-18T04:14:26+00:00", "quality_score": 0.5078, "relevance": 0.3042, "tags": ["plant"], "text": "Greek Yoghurt overconsumption? Title: Greek Yoghurt overconsumption? Post: What is a healthy quantity of greek yoghurt a day? Some people eat 500 grams to 1 kg of non fat greek yoghurt as a source of protein for building muscle Comments: Shit there is an unhealthy quantity? Everything has a limit of overconsumption but depends on a few things so its unique foe everyone. The danger is eating that much of something which restricts your diet in a way that there is not enough variety for healthy eating. If you leave out food geouos from your diet or jist not have enough plant protein etc It's just fermented milk. People can chug a gallon of milk a day without issue (as long as they're not sensitive to lactose or dairy). Go ham. Pretty consistently have 150-200g per day and weight hardly fluctuates across the year. 5% fat variety. It can certainly be part of a varied diet. Depends on what else is in your diet. I usually stick to about 200â€“300 g a day, and that feels like plenty for protein. Eating too much at once can be hard on your stomach, so spreading it out over the day works best. #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* I am addicted to the vanilla protein Greek yogurt, watermelon, and Tajin. Greek yogurt can definitely be a healthy protein source, but like most things, moderation matters. For many people, 1â€“2 servings a day (around 150â€“250g per serving) is a common range. Eating 500g or more isnâ€™t automatically unhealthy, especially if it fits into your overall calorie, protein, and nutrient needs, but it may be more than necessary for some. It also depends on the rest of your diet, your activity level, and how well your body tolerates dairy. If someoneâ€™s eating closer to 1kg daily, itâ€™s worth balancing it with other protein sources and keeping an eye on things like digestion, calcium, and overall variety. I prefer to get my protein from multiple sources. But nothing wrong with eating a lot of Greek yogurt as long as youâ€™re eating other whole foods high in protein"}
{"url": "https://www.reddit.com/r/nutrition/comments/1mokm6m/how_many_grams_of_complete_protein_would_you_say/", "title": "How many grams of complete protein would you say?", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-12T20:51:33+00:00", "quality_score": 0.5058, "relevance": 0.349, "tags": ["whey", "collagen"], "text": "How many grams of complete protein would you say? Title: How many grams of complete protein would you say? Post: There is a new sparkling clear protein drink at Costco called Genius Gourmet Sparkling Protein blue raspberry lemonade. It says it has 30g of protein but does not include the DV%. The first three ingredients are: carbonated water, whey protein isolate, collagen peptides. Since the whey is listed first, I am assuming it is at least 15g of complete protein per can, but really wish I was able to find a source with the exact amount, or at least the DV% to be able to estimate. Wondering if anyone has any insight or if you agree with my logic? Comments: [deleted] The company doesnâ€™t seem to list it anywhere, Iâ€™ve actually bought their protein bars before (theyâ€™re tiny and high in calories) Just assume 15g from whey Why is complete protein different by gram than whey protein isolate? Complete protein doesn't matter at all as long as you eat a reasonable variety of foods. #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* I know this is long, but please hear me out Okay, so i had to play a game with this one, just, because, (no good reason) This is what I did, using a free online amino acid bar chart I added in some whey, and since there was no whey protein isolate with amino acid breakdown available, I just used whey in the amount needed to get to 7.5g total protein. I chose that amount because, as you pointed out, we might as well start off assuming that half of the 30g protein is from the whey isolate, and I took half of that half, so that I can see what is in just half of the container [https://tools.myfooddata.com/protein-calculator/171281/oz/2.25/1](https://tools.myfooddata.com/protein-calculator/171281/oz/2.25/1) using the same method, for the gelatin alone [https://tools.myfooddata.com/protein-calculator/169599/wt1/1.25/1](https://tools.myfooddata.com/protein-calculator/169599/wt1/1.25/1) Then I added both in the same chart [https://tools.myfooddata.com/protein-calculator/169599-171281/wt1-oz/1.25-2.25/1](https://tools.myfooddata.com/protein-calculator/169599-171281/wt1-oz/1.25-2.25/1) when I looked at the missing amino acid in gelatin (tryptophan) , with the amounts of each ingredient i assumed, this is no longer the limiting amino acid for the combination and basically the same thing but with the 30g total [https://tools.myfooddata.com/protein-calculator/169599-171281/wt1-oz/2.5-4.5/1](https://tools.myfooddata.com/protein-calculator/169599-171281/wt1-oz/2.5-4.5/1) I'm not sure if this is useful to you at all I hadn't heard of this thing about DV% on labels, so I had to look it up, and found this, which I would have had no idea about if it weren't for your post, so thanks for the TIL! [https://blog.trustwell.com/using-a-pdcaas-value-to-display-dv-protein-on-your-supplements-facts-label](https://blog.trustwell.com/using-a-pdcaas-value-to-display-dv-protein-on-your-supplements-facts-label) (this page appears to be about supplements rather than foods, but still interesting)"}
{"url": "https://www.reddit.com/r/nutrition/comments/1msliiq/recipes_with_collagen_peptides/", "title": "Recipes with collagen peptides?", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-17T08:27:46+00:00", "quality_score": 0.5056, "relevance": 0.3102, "tags": ["whey", "collagen"], "text": "Recipes with collagen peptides? Title: Recipes with collagen peptides? Post: How do you guys eat collagen peptide powder? Comments: Wit water On empty stomach At 11am n 3pm I combine it with electrolyte packets in water. It takes on the flavor of the electrolyte packet I'm using it for joint pain/aches and just mix some into my yogurt every morning at breakfast. In morning coffee or tea Put it in my whey shake I usually mix it into my morning smoothie or oatmeal. Super easy and it doesnâ€™t change the taste much. Sometimes I add it to coffee too! #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* Unflavoured collagen in soups, stews or any liquidy type of savoury dish. Or fruit flavoured collagen in water, juice or smoothies. Vanilla or chocolate flavours in oats. I just add it to my protein shake"}
{"url": "https://www.reddit.com/r/nutrition/comments/1m79xkq/protein_quality_vs_quantity_how_much_do_amino/", "title": "Protein quality vs quantity - how much do amino acid gaps matter?", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-07-23T13:56:05+00:00", "quality_score": 0.495, "relevance": 0.3994, "tags": ["whey", "plant", "athletes"], "text": "Protein quality vs quantity - how much do amino acid gaps matter? Title: Protein quality vs quantity - how much do amino acid gaps matter? Post: Hello everyone, Iâ€™m currently consuming around 160g of protein per day while on a cut and doing strength training 6 days a week. Iâ€™m a vegetarian, so my protein sources are somewhat limited: * 60g from whey * \\~20g from yogurt * 30â€“40g from soy or pea protein * The rest (\\~40â€“50g) comes mostly from gluten/seitan and other plant-based foods After breaking down the essential amino acid profile, I noticed that most EAAs are well above target, but Iâ€™m still slightly low on Methionine, Valine, and Histidine, likely due to the plant-based portions being incomplete sources. My question is does this kind of EAA imbalance significantly hinder muscle protein synthesis or recovery? And is it worth supplementing (e.g. L-Methionine) to bridge the gap, or am I still getting enough overall for effective results? Thanks. Comments: 160 g protein per day. Assuming you're 88 kg or below, you're probably fine quantity size. (1.8 g/kg bodyweight.) Most of your sources are complete (estimated at >80%) so you are probably fine. Soy protein is complete on its own. If you combine peas with rice they complement each other (I don't have the ratios at the ready) so they are complete proteins together. So you could add some rice to your diet to complement the peas. Taking targeted supplements seems unnecessarily expensive to me. Adding rice or quinoa to your diet is probably a lot cheaper. (Based on a video made by dr. in exercise physiology Mike Israetel.) if building muscle is your goal, don't forget to chill, sleep and train hard. With the amount you are eating protein quality doesn't matter all that much unless you are already an absolute unit (like 250 pounds or more) Cooked soybeans, tofu, edamame, tempeh. Add a few tbsp of soybeans to every meal. One cup of cooked soybeans has 31 grams of complete protein. I batch cook soybeans in a pressure cooker and use these as my â€œsupplementâ€. Inexpensive, 5 lb. non-GMO bags at international grocer. Gaps only matter if your protein sources are almost purely plant sourcesâ€”-which would require around 20% more total protein intake. Mixed sources donâ€™t need more #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* Thatâ€™s way too much unless youâ€™re like 250+ pounds dude. Your kidneys are drowning in protein. Unless youâ€™re training extremely hard but thatâ€™s still too much. A 170 pound man only needs around 60grams a day. I would not take that much unless youâ€™re training extremely hard. You donâ€™t need that much protein dude."}
{"url": "https://www.reddit.com/r/nutrition/comments/1mhqz78/best_mealreplacement_shakes/", "title": "Best Meal-Replacement Shakes", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-04T21:52:25+00:00", "quality_score": 0.4944, "relevance": 0.3301, "tags": [], "text": "Best Meal-Replacement Shakes Title: Best Meal-Replacement Shakes Post: Hi All, hope youâ€™re well! Iâ€™m in a season of life where eating 3+ meals/snacks isnâ€™t feasible and Iâ€™m looking for the most well rounded meal replacement shake/powder that meets the most protein/veg/mineral ideals. Any suggestions? Comments: Huel is great Thatâ€™s the exact reason Soylent was created. There are plenty of others these days though, Huel and JimmyJoy both have plenty of supporters and are just as good but Soylent still tends to be more convenient and affordable Iâ€™ve been in a similar spot OP, busy days make full meals tough. Lately, Iâ€™ve been mixing my own quick blend of protein powder, frozen fruit, some oats and a splash of Vita Coco if I need a hydration boost. Itâ€™s not fancy but it works when I donâ€™t feel like doing the full meal shake thing. Quick and no cleanup stress. Goodluck OP! Soylent or Huel were designed for this purpose Huel, Iâ€™ve been using them daily for years. beware of too much calcium fortification in a lot of these items. There's no reason they need to dump as much calcium as they do into them other than people think they need that much. I'd recommend something like this, but when you drink 2 a day, and then add in almond or regular milk, you can quickly creep up to 200% daily calcium intake, which should be compensated for with magnesium, and even then it's not ideal. https://www.samsclub.com/p/premier-protein-high-protein-shake-chocolate/prod24964331 https://www.samsclub.com/p/members-mark-high-protein-chocolate-shake-11-floz-18pk/prod24631331 You don't really need vitamin fortified drinks if you just take a daily multi it's the same thing. You don't need excessive amounts of vitamins in the diet for the most part. Whole food diet is typically sufficient. I really like the taste of these... https://www.samsclub.com/p/owyn-pro-elite-plant-protein-shake-chocolate-15-ct/P03016655?xid=you-might-also-like_10 Most of them are just some kind of protein powder with psyllium for fiber and oats for carbs. You can do it yourself. Just make sure to have enough variety for the day feom your other meals #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* Kachava is awesome but expensive Been using JimmyJoy for years. I use the Active powder for the additional protein since Iâ€™m fairly active. Flavor and consistency is amazing and I never have to think about or shop for one of my daily meals. I have a subscription setup from their website so I save money and it comes on a schedule so I never run out."}
{"url": "https://www.reddit.com/r/nutrition/comments/1mie11x/nutritional_benefit_and_industry_practice_on_soy/", "title": "Nutritional benefit and industry practice on soy protein isolate fortified with leucine", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-05T16:34:37+00:00", "quality_score": 0.4935, "relevance": 0.3454, "tags": ["whey", "plant"], "text": "Nutritional benefit and industry practice on soy protein isolate fortified with leucine Title: Nutritional benefit and industry practice on soy protein isolate fortified with leucine Post: If let say protein powder product that uses soy protein isolate(SPI) fortified with leucine to mitigate the low leucine content. However questions arise on: 1. How beneficial is this in improving SPI protein quality for muscle synthesis. The product adds 3g of leucine and this supposedly improve the amino acid profile of SPI. The logic seems to add up but I am curious if this makes a good source compare to whey protein WPC/WPI. 2. Whether in food industry it is acceptable to not call this as \"amino spiking\" that is synonymous with scamming protein amount per serving due to higher nitrogen content. If the product is transparent of its purpose but uses protein content per serving without deducting the added leucine; is it considered amino spiking? Is all \"amino spiking\" bad? Should the company revise their labels, marketing and change the protein content advertised? I am more inclined to say it's okay but perhaps people from the nutrition field can describe it better or have specific opinions. This is not a post seeking professional medical advice. Comments: I don't really see a problem with \"amino spiking\". Though I would also question if you needed to add the leucine at all. Chances are the person would not be deficient in leucine anyway, especially if they are intaking protein in excess. When I took a look at a soy protein isolate (25g) on Chronometer the leucine amount was fine. #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.*"}
{"url": "https://pubmed.ncbi.nlm.nih.gov/40799195/", "title": "Characterisation of potential interactions between urease inhibitor N-(n-butyl) thiophosphoric triamide (NBPT) and whey protein isolate.", "source_type": "pubmed_article", "is_verified": true, "published_at": "2025-07-01T00:00:00+00:00", "quality_score": 0.4902, "relevance": 0.3335, "tags": ["whey"], "text": "Characterisation of potential interactions between urease inhibitor N-(n-butyl) thiophosphoric triamide (NBPT) and whey protein isolate. Characterisation of potential interactions between urease inhibitor N-(n-butyl) thiophosphoric triamide (NBPT) and whey protein isolate. Urea fertilizer augmented with the urease inhibitor (UI) N-(n-butyl)-thiophosphoric triamide (NBPT), is used to stabilize nitrogen and reduce greenhouse gas emissions. Although studies have shown that NBPT does not enter milk via cattle grazing on NBPT-treated fields, questions remain about its potential to impact milk components were it inadvertently to enter the dairy supply chain. The aim of this study was to examine possible effects of NBPT on the chemistry and functionality of whey protein isolate (WPI). NBPT raised the peak denaturation temperature of WPI ("}
{"url": "https://www.reddit.com/r/nutrition/comments/1mbm3ix/importance_of_consuming_fast_proteins/", "title": "Importance of consuming 'fast' proteins", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-07-28T17:11:41+00:00", "quality_score": 0.4883, "relevance": 0.385, "tags": ["whey", "casein", "plant", "athletes"], "text": "Importance of consuming 'fast' proteins Title: Importance of consuming 'fast' proteins Post: TLDR: Wondering if we should be getting most of our protein from protein shakes Many of you have probably seen this list of protein absorption by type: * **Whey Protein Isolate -** 8 - 10 g/hr * **Whey Protein Concentrate -** 6 - 8 g * **Soy Protein Isolate**\\~ 4 g * **Egg White Protein**\\~ 3 g * **Chicken/Beef (Whole Food)**\\~ 2.5 - 3 g * **Casein Protein**\\~ 1.5 - 2 g If the goal is to get as much as 1 gram of protein per pound and there are only 24 hours in a day, wouldn't this mean we should strive for whey protein for most of our protein, with 20-40 grams every 3 hours? (The exception being taking something longer like casein at night) And furthermore, since no whole foods derive a majority of their protein from whey, would this mean the best way to get protein is from artificial sources of whey? This conclusion seems to go against common sense of preferring whole foods, so I'm wondering if I'm missing something Comments: Fast digesting protein is good for muscle protein synthesis, but longer sustained/slower absorbed protein helps against muscle protein breakdown. Both are equally as important for total protein balance Large meals with fast digesting protein will act similar to slow digesting protein shakes because of absorption TLDR: Fast isnâ€™t better than slow. Both are important Dude, are you serious? These are details you should not be concerned with. What are you? An elite powerlifter/bodybuilder? You'll spin your wheels minmaxing lifting. I think what you are missing is scientific basis for why we should be consuming 1g of protein per lb of body weight. Where is everyone getting this 1g per lb reference point that keeps coming up in this sub? All the published scientific paper and health agency recommendations Iâ€™ve seen is 0.8-1g per kilogram of body weight for typical sedative to moderately adults, and up to 1.6g per kilo (2.2lbs) for highly active athletes. While ~2g of protein per kilo is generally safe in the short term, there is some research showing that sustained daily consumption of that much protein in the long term can put a strain on the kidneys. It doesnâ€™t make sense because we donâ€™t need to try to cram that much protein into our bodies every day. 1. Very few people need 2g per kilo 2. Youâ€™re forgetting the food matrix #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* How about pea protein?"}
{"url": "https://www.reddit.com/r/nutrition/comments/1mhpc8b/whey_protein_brands/", "title": "Whey protein brands", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-08-04T20:49:48+00:00", "quality_score": 0.4808, "relevance": 0.3296, "tags": ["whey"], "text": "Whey protein brands Title: Whey protein brands Post: Looking for recommendations on brands of whey protien that offer good value, here is my criteria. No ace-k (avoiding due to limited research), No stevia only sweetened (canâ€™t stand the taste of stevia on its own, okay if itâ€™s mixed with sucralose or something else) Concentrate or isolate is fine. Anyone have any products they like that fit this criteria? Comments: Look into Legion Athletics, its the only brand I use and I believe it fits your criteria. Optimum nutrition is one of the best Iâ€™ve had. Itâ€™s better than muscle milk. Gott give a shout out to Naked brand protein and PB. Itâ€™s pure. Going to say levels protein. Itâ€™s flavor is not as strong as other but mainly due to lake of emulsifiers and sugar. Personally I prefer Bulk or Grenade both for consistency and taste. Momentous Jocko Fuel Boost unflavored. Yamamoto nutrition The unflavoured one by Bulk is pretty good."}
{"url": "https://www.reddit.com/r/nutrition/comments/1mdcukt/protein_for_building_a_kilogram_of_lean_muscle/", "title": "Protein for building a kilogram of lean muscle?", "source_type": "reddit_post", "is_verified": false, "published_at": "2025-07-30T17:30:14+00:00", "quality_score": 0.4557, "relevance": 0.311, "tags": ["timing", "athletes"], "text": "Protein for building a kilogram of lean muscle? Title: Protein for building a kilogram of lean muscle? Post: So basically I came across the fact that human muscles are only 22% protein,rest is water, glucose and other stuff. This got me curious ðŸ¤¨. I intake 100gm of protein a day, assuming all of it is absorbed by my body and most of it is going in repairing and building muscles, I'd be putting on at least 500 gms of lean muscle every day which is clearly not the case. So either of two things is the case: 1) It actually takes much more protein than 100 gm to make 500 gm of muscle, i.e. the conversion isn't proportional to 1:5. 2) Or, my body just doesn't need 100 gms of protein a day and isn't absorbing most of it. Now this might be a dumb question as I have no idea about the biology being this stuff, but the math isn't adding up. Pls help. Comments: Building 1kg of lean muscle isnâ€™t just about depositing 220g of protein, it also requires energy, hormones, training stimulus, time, and cellular adaptations. Your 100 g of daily protein isnâ€™t used exclusively for muscle growth, much of it supports maintenance of existing tissues, enzyme and hormone production, immune function, and other processes. Muscle gain is also limited by your bodyâ€™s capacity to synthesize new tissue, on average, people can gain 0.25â€“0.5 kg of lean mass per week with optimal training and nutrition. So itâ€™s not that youâ€™re wasting protein, but that muscle growth is a slow, regulated process, not a direct â€œinput-outputâ€ system. The reason the math doesnâ€™t â€œadd upâ€ is that **muscle growth is far more complex than simply converting dietary protein into muscle tissue**. * **Muscle is dynamic tissue.** Itâ€™s constantly breaking down and rebuilding depending on your fasting state, nutrient storage, engagement in activities, physiological and psychological stress, medication and a lot of other reasosns. Even at maintenance, a lot of the protein you eat is used to replace existing proteins, not just build new muscle * **Protein is not only used for muscle synthesis.** Only a fraction of protein intake is used for that reason. Other amino acid utilisation includes enzyme production, energy production when needed, hormone production, and immune function. * **Muscle building is regulated.** Even if you eat a lot of protein, your body has a limit to how fast it can synthesise new muscle. Training, hormones, genetics, and recovery are the main drivers. >!Fun fact: anabolic steroids can lift this limit. ***obviously with severe and dangerous side effects. DO NOT USE THEM***!< * **Muscle gain includes more than protein.** Lean muscle mass is \\~22% protein by weight, but the rest (water, glycogen, minerals,) also depends on factors like hydration and carbohydrate intake. **What** **you should focus on:** 1. **Balanced eating:** Eat around 1,4 - 2,0 g/kg protein to maximize muscle growth. Eat carbs and vegetables too, healthy fats will assist your overall health and muscle building journey. 2. Train regularly: Resistance training will stimulate muscle growth. Do not skip out on cardio, it has very important positive metabolic outcomes that will lead to less protein being used for energy production and more going to your muscles. 3. **Sleep well:** Sleep is ofter overlooked but is just as important as the other elements in muscle building and post workout recovery. 4. **Skip alcohol:** Literally a toxin. Less literally, it \"kills your gains\". 5. **Supplementation:** Try to hit protein and nutritional goals through whole foods. A good protein supplement or protein + carbs supplement is helpful if you can't. Anything other than creating and maybe a multivitamin is mostly considered not effective, except if you're a really high level athlete and following a completely tailored fitness and diet plan and are under constant medical supervision. #### About participation in the comments of /r/nutrition Discussion in this subreddit should be rooted in science rather than \"cuz I sed\" or entertainment pieces. Always be wary of unsupported and poorly supported claims and especially those which are wrapped in any manner of hostility. You should provide peer reviewed sources to support your claims when debating and confine that debate to the science, not opinions of other people. **Good** - it is grounded in science and includes citation of peer reviewed sources. Debate is a civil and respectful exchange focusing on actual science and avoids commentary about others **Bad** - it utilizes generalizations, assumptions, infotainment sources, no sources, or complaints without specifics about agenda, bias, or funding. At best, these rise to an extremely weak basis for science based discussion. Also, off topic discussion **Ugly** - (removal or ban territory) it involves attacks / antagonism / hostility towards individuals or groups, downvote complaining, trolling, crusading, shaming, refutation of all science, or claims that all research / science is a conspiracy *Please vote accordingly and report any uglies* --- *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nutrition) if you have any questions or concerns.* Amino acids are used for many different things your body does. This is why you need a lot of protein to build muscle. Your body only grows what it can afford. You need protein for basic maintenance of your body. Every tiny little part of you needs protein. Not just your muscles. We need more details. Whatâ€™s your height, weight, gender, exercise regimen. Iâ€™m pretty confident you are under eating protein. Youâ€™re body needs excess amounts of materials and energy to create more muscle mass. Especially if you want to create it quickly."}
